Tekla.Structures.Model.Assembly.AssemblyTypeEnum
The assembly types.

Tekla.Structures.Model.Assembly.AssemblyTypeEnum.STEEL_ASSEMBLY
The steel assembly type.

Tekla.Structures.Model.Assembly.AssemblyTypeEnum.PRECAST_ASSEMBLY
The precast assembly type.

Tekla.Structures.Model.Assembly.AssemblyTypeEnum.IN_SITU_ASSEMBLY
The in-situ assembly type.

Tekla.Structures.Model.Assembly.AssemblyTypeEnum.TIMBER_ASSEMBLY
The timber assembly type.

Tekla.Structures.Model.Assembly.AssemblyTypeEnum.UNKNOWN_ASSEMBLY
The unknown assembly type.

Tekla.Structures.Model.Assembly.AssemblyTypeEnum.REBAR_ASSEMBLY
The rebar assembly type.